Autodesk.Revit.DB.Lighting.LightGroup.RemoveLight(Autodesk.Revit.DB.ElementId)
Remove the given light instance from the set of light instances in this group
lightId:
The light instance to remove
Throws Autodesk.Revit.Exceptions.ArgumentException:
The light instance is not in this LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup.AddLight(Autodesk.Revit.DB.ElementId)
Add a new light instance to the group
lightId:
The ID of the light instance to add to the group
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element ID does not correspond to a light instance
-or-
The light instance is in this LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Lighting.LightGroup.Name
The name of the LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: The name is not valid because it is not unique within this LightGroupManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013